# Parameter Type Id Array Group And Associate Property

Source: https://www.revitapidocs.com/2026/7dd7e417-b2b8-3775-6cf3-72758c18bddd.htm

---

| Parameter Type Id Array Group And Associate Property |
| --- |

"Group And Associate"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId ArrayGroupAndAssociate { get; }
```

```
Public Shared ReadOnly Property ArrayGroupAndAssociate As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ ArrayGroupAndAssociate {
	ForgeTypeId^ get ();
}
```

```
static member ArrayGroupAndAssociate : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace